জাভাস্ক্রিপ্টে, "আউটপুট" বলতে ব্যবহারকারী বা ডেভেলপারকে ডেটা বা ফলাফল দেখানোর বিভিন্ন উপায়কেবোঝায় । ওয়েব পেজে, পপআপে, নাকি ডেভেলপার টুলসে তথ্য দেখাতে চাওয়া হসছে, 
তার উপর নির্ভর করে চারটি প্রধান পদ্ধতি ব্যবহৃত হয়।

💻 ১. console.log() — ডেভেলপারদের প্রথম পছন্দ
যখন কোড লিখা হবে এবং ব্যাকহ্যান্ডে বা ব্রাউজারের ইনস্পেক্ট এলিমেন্টের "Console" ট্যাবে আউটপুট দেখতে চাওয়া হবে, তখন এটি ব্যবহার করা হয়। লজিক টেস্ট করার জন্য এটি সবচেয়ে বেশি জনপ্রিয়।

let name = "Mohammad Abdullah";
console.log(name); 

// আউটপুট আসবে: Mohammad Abdullah

🚨 ২. alert() — পপ-আপ মেসেজ বক্স
 যদি চাওয়া হয় স্ক্রিনের ওপর একটা ছোট্ট পপ-আপ বক্স বা অ্যালার্ট মেসেজ ভেসে উঠুক, তবে এটি ব্যবহার করতে হয়।

alert("মিশন সাকসেসফুল!"); 

// আউটপুট: ব্রাউজারের স্ক্রিনে একটা পপ-আপ বক্স আসবে যেখানে লেখা থাকবে "মিশন সাকসেসফুল!"


📄 ৩. document.write() — সরাসরি ওয়েবসাইটে লেখা
 এইচটিএমএল (HTML) ওয়েবসাইটের পেজের ভেতর সরাসরি কোনো লেখা বা আউটপুট প্রিন্ট করে দেওয়ার জন্য এটি ব্যবহার করা হয়। (তবে প্রফেশনাল কোডে এটি একটু কম ব্যবহার করা হয়)।

document.write("হ্যালো গঙ্গাচড়া, রংপুর!"); 

// আউটপুট: ওয়েবসাইটের সাদা পেজের ভেতর সরাসরি এই লেখাটি প্রিন্ট হয়ে যাবে।


🎯 ৪. innerHTML — নির্দিষ্ট কোনো জায়গায় আউটপুট বসানো
প্রফেশনাল ওয়েব ডেভেলপমেন্টে এটি সবচেয়ে বেশি ব্যবহৃত হয়। এইচটিএমএল পেজের কোনো একটা নির্দিষ্ট ট্যাগ (যেমন <p> বা <h1>) এর ভেতর জাভাস্ক্রিপ্টের আউটপুট ঢুকিয়ে দেওয়ার জন্য এটি ব্যবহার করা হয়।
  
<p id="demo"></p>    //এইচটিএমএল html

document.getElementById("demo").innerHTML = "আপনার আজকের স্কোর: ১০০";  js


alert("Bangladesh Travel");

document.write("<strong>Name :</strong> Abdullah Arman </br>");
document.write("<strong>Address :</strong> Rangpur, Bangladesh </br>");
document.write("<strong>Phone :</strong> <em>01568451112</em?");

