জাভাস্ক্রিপ্টে (JavaScript) কি-ওয়ার্ড (Keyword) হলো কিছু সংরক্ষিত শব্দ (Reserved words), যেগুলোর নির্দিষ্ট অর্থ ও কাজ রয়েছে। এগুলো ভ্যারিয়েবল ডিক্লেয়ার, লজিক নিয়ন্ত্রণ এবং ফাংশন তৈরিতে ব্যবহৃত হয়।
এই শব্দগুলোর একটা নির্দিষ্ট অর্থ এবং কাজ জাভাস্ক্রিপ্ট ল্যাঙ্গুয়েজের ভেতরে ফিক্সড করা আছে। চাইলে এই শব্দগুলোকে নিজের ইচ্ছামতো ভেরিয়েবলের নাম, ফাংশনের নাম বা কোনো আইডেন্টিফায়ার হিসেবে ব্যবহার করা যাবে না।

যেমন: চাইলে let let = 10; বা let if = "Abdullah"; লিখা যাবে না , কারণ let এবং if হলো সংরক্ষিত কীওয়ার্ড।

জাভাস্ক্রিপ্টে প্রায় ৬০টিরও বেশি কীওয়ার্ড আছে। আপনি যখন কোড এডিটর বা IDE (যেমন: VS Code) ব্যবহার করা হবে, তখন এই কীওয়ার্ডগুলো লেখার সাথে সাথেই কোডের টেক্সটের রঙ বদলে নীল বা বেগুনি হয়ে যাবে।

রঙ বদলে যাওয়া দেখেই বুজা যাবে একটি সংরক্ষিত শব্দ বা কীওয়ার্ড। সি এবং সি++ ল্যাঙ্গুয়েজেও কিন্তু ঠিক একইভাবে int, float, if, for, return শব্দগুলো কীওয়ার্ড হিসেবে কাজ করে।

কীওয়ার্ড (Keyword)	                      সহজ বাংলায় কাজ (Description)	                  ছোট উদাহরণ (Example)

let	                                   ব্লক-স্কোপড ভেরিয়েবল তৈরি বা 
                                       ঘোষণা করার জন্য ব্যবহৃত হয়। (আধুনিক নিয়ম)	       let age = 30;

const	                                 এমন ভেরিয়েবল তৈরি করে যার মান কখনো 
                                       পরিবর্তন বা আপডেট করা যায় না (Constant)।	         const pi = 3.1416;

var	                                   পুরোনো নিয়মে ভেরিয়েবল ঘোষণা করার 
                                       জন্য ব্যবহৃত হতো (গ্লোবাল বা ফাংশন স্কোপড)।          var name = "Mohammad";

if	                                  কোনো শর্ত বা কন্ডিশন চেক করার ব্লক 
                                      শুরু করতে ব্যবহৃত হয়।	                             if (x > 5) { ... }

else	if                             এর শর্ত মিথ্যা হলে বিকল্প কোন কাজটি হবে, 
                                     তা নির্ধারণ করে।	                                     else { ... }

for	                                একটি নির্দিষ্ট সংখ্যক বার কোনো কোড 
                                    লুপ বা বারবার চালানোর জন্য ব্যবহৃত হয়।	                 for(let i=0; i<5; i++)

while	                              নির্দিষ্ট কোনো শর্ত সত্য থাকা পর্যন্ত লুপ 
                                    চালিয়ে যাওয়ার জন্য ব্যবহৃত হয়।	                         while (x < 10)

this	                              বর্তমান যে অবজেক্ট বা কনটেক্সটে কোড রান হচ্ছে, 
                                    তাকে নির্দেশ করে।                                    	this.name = name;

try / catch                         কোডের ভেতর কোনো ভুল বা এরর (Error) 
                                    আসলে তা হ্যান্ডেল বা কন্ট্রোল করার জন্য।                 try { ... } catch(err)

new	                                অবজেক্ট ওরিয়েন্টেড প্রোগ্রামিংয়ে কোনো ক্লাসের নতুন 
                                    একটি অবজেক্ট তৈরি করতে।	                          let car = new Car();

switch	                            একটি ভেরিয়েবলের অনেকগুলো সম্ভাব্য মানের মধ্যে 
                                    থেকে সঠিকটি বেছে নেওয়ার জন্য।	                      switch(color) { ... }


case	                            switch ব্লকের ভেতরে একেকটি নির্দিষ্ট 
                                  অপশন বা মান চেক করার জন্য।	                        case "red":


var	- Declares a variable

let	- Declares a block variable

const -	Declares a block constant

if - Marks a block of statements to be executed on a condition

switch - Marks a block of statements to be executed in different cases
for	Marks a block of statements to be executed in a loop

function - Declares a function

return - Exits a function

try	- Implements error handling to a block of statements
