Null Data Type:

জাভাস্ক্রিপ্টে Null একটি বিশেষ ডেটা টাইপ। এটি মূলত একটি ভেরিয়েবলের "খালি" বা "অনুপস্থিত" মান প্রকাশ করতে ব্যবহৃত হয়। 
যখন কোনো ভেরিয়েবলকে ইচ্ছাকৃতভাবে খালি রাখতে চাওয়া হয় , তখন সেখানে null সেট করে দেওয়া হয়। 

let name = ""; // blank string
let myName = null;

console.log(myName); // Output: null
console.log(typeof myName); // Output: object

Null এর প্রকৃত অর্থঃ 

null মানে হলো "কিছুই নেই" (Nothing)। এটি একটি ভেরিয়েবলের জন্য একটি অ্যাসাইন করা মান। ভেলুর উপর নির্ভর করে ভেরিয়েবল কি টাইপের।
আর null মানে হলো ভেরিয়েবলটিকে খালি বলে ঘোষণা করা হয়েছে। যদি েরিয়েবল নাল হয়  ভেলু প্রবেশ করে নি।

typeof null - জাভাস্ক্রিপ্টের একটি (Bug)ঃ

let x = null;
console.log(typeof x); // আউটপুট আসবে: "object"

এটি জাভাস্ক্রিপ্টের একদম শুরুর দিকের একটি ভুল (Bug)। জাভাস্ক্রিপ্ট যখন তৈরি করা হয়েছিল, তখন মেমরি ম্যানেজমেন্টের জন্য null কে অবজেক্ট হিসেবে ধরা হয়েছিল। এখন চাইলে এটি ঠিক করা সম্ভব নয়, 
কারণ হাজার হাজার ওয়েবসাইট এই ভুলের ওপর ভিত্তি করেই তৈরি হয়ে গেছে। তাই এটি এভাবেই থেকে গেছে।
